---

C#Visual BasicVisual C++

Revit 2024 API
---
SweptBlend..::..PathSketch Property
SweptBlend Class See Also Send Feedback
---

The sketched path for the swept blend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Sketch PathSketch { get; }

Visual Basic
---

    Public ReadOnly Property PathSketch As Sketch
    	Get

Visual C++
---

    public:
    property Sketch^ PathSketch {
    	Sketch^ get ();
    }

# Remarks

If the swept blend is based on selected 3d curve, this property is nullNothingnullptra null reference (Nothing in Visual Basic).

# See Also

SweptBlend Class

Autodesk.Revit.DB Namespace